Repository: jenberu/Django-Online-shoping
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: Tell Us about your self
am: ስለራስዎ ይንገሩን

source: First Name
am: ስም

source: Last Name
am: የአባት ስም

source: Email Address if any
am: ኢሜል አድራሻ ካለዎት

source: ADVERTISEMENT
am: ማስታወቂያዎች

source: Username already taken. Choose new username.
am: ይህ ስም ተይዟል እባከዎ ሌላ ይምረጡ

source: Passwords do not match
am: ይለፍ ቃል ተሳስተዋል

source: username and password do not match
am: ስም እና ይለፍ ቃል አልተዛመዱም

source: Pleace Insert correct data
am: እባከዎ ትክክለኛ መረጃ ያስገቡ

source: Password has been reset successfully.
am: የይለፍ ቃል በተሳካ ሁኔታ ተቀይሯል

source: User with the given username does not exist.
am: በዚ ስም ዩዘር የለም

source: New password and confirm password do not match.
am: ያስገቡት የይለፍ ቃል ማች አልሆነም

source: Quantity
am: ብዛት

source: Your shopping cart
am: የእርሰዎ ዘንቢል

source: Your shopping cart at
am: የእርሰዎ ዘንቢል ከ

source: Image
am: ምስል

source: Product
am: ምርት

source: Remove
am: አስወግድ

source: Unit price
am: የአንድ ዋጋ

source: Price
am: ዋጋ

source: Update
am: ቀይር

source: Birr
am: ብር

source: Subtotal
am: ንዑስ አጠቃላይ

source: Discount
am: ቅናሽ

source: Total
am: አጠቃላይ

source: Continue shopping
am: መግዛት ይቀጥሉ

source: Checkout
am: ትእዛዘዎን ያስቀምጡ

source: People who bought this also bought
am: ይህን የገዙ ሰዎች ይህንም ይገዛሉ

source: you should checkout this cart before requesting the order in other shop
am: ወደ ሌላ ሱቅ ከመሄደዎ በፊት መጀመሪያ ይህን ትእዛዝ ይዘዙ(ባንድ ዘንቢል ከሁለት ሱቅ መግዛት አይችሉም)

source: Apply for Discount
am: ለቅናሽ ያመልክቱ

source: English
am: እንግልዘኛ

source: Amharic
am: አማረኛ

source: first name
am: ስም

source: last name
am: የአባት ስም

source: e-mail
am: ኢሚይል

source: address
am: አድራሻ

source: postal_code
am: ፖስታ ቁጥር

source: city
am: ከተማ

source: phone number
am: ስልክ ቁጥር

source: Your order
am: የእርሰዎ ትእዛዝ

source: "%(code)s" (%(discount)s%% off)
am: "%(code)s" (%(discount)s%% ቅናሽ)

source: fill the following form to place an order
am: ትእዛዘዎን ለማስቀምጥ እባከዎን የሚከተለዉን ፎርም ይሙሉ

source: Place order
am: ትእዘዘዎን ያስቀምጡ

source: shop Information
am: የሱቁ መረጃ

source: Contact Information
am: መገናኛ መረጃ

source: Phone
am: ስልክ

source: Email
am: ኢሚይል

source: Estimated Delivery Time
am: ወደ እርሰዎ የምናመጣበት ሰአት

source: The time that you have specified in Delvery date field
am: እርሰዎ በመረጡት ሰአት

source: Customer Support
am: ደንበኛ ማገዝ

source: If you have any questions, please contact our support team.
am: ማንኛውም አይነት ጥያቄ ካለወት ፣ ከዚህ በታች በተቀመጡት መገናኝ ያናግሩን

source: Return Policy
am: ሪተርን ፖሊሲ

source: You can return any item within 30 days of purchase.
am: በ 30 ቀን ማንኝዉንም የገዙትን እቃ መመለስ ይችላሉ።

source: Promotions
am: ማስታወቂያ

source: Check out our latest promotions on our homepage.
am: አድስ ማስታወቂያወችን ይመሊከቱ

source: Thank you
am: እናመሰኛለን

source: Your order has been successfully completed. Your order number is <strong>%(order_id)s</strong>.
am: ትእዛዘዎ በተሳካ ሁነታ ተልኳል፡፡ የትእዛዘዎ ቁጥር <strong>%(order_id)s</strong> ነው ::

source: My Shop
am: የኔ ገበያ

source: Order no.
am: የትእዛዝ ቁጥር

source: Bill to
am: ለ

source: Items bought
am: የተገዙ እቃዎች

source: Cost
am: ዋጋ

source: Paid
am: የተከፈለ

source: Pending payment
am: ያልተከፈለበትያልተከፈለበት

source: please enter valid data for all fields
am: እባከዎ ትክክለኛ መረጃ ያስገቡ

source: your cart is empity pleace add item to checkout
am: ዘንቢለዎ ባዶ ነው ፣ ተእዛዝ ለመላክ እቃ ይጨምሩ

source: Payment canceled
am: ክፍያዎ አልተሳካም።

source: Payment successful
am: በተሳካ ሁኔታ ተከፍሏል።

source: Your payment was successful
am: በተሳካ ሁኔታ ከፍለዋል

source: Your payment has been processed successfully.
am: ክፍይዎ በተሰካ ሁኔታ ተከፍሏል።

source: Payment Cancelled
am: ክፍያዎ አልተሳካም።

source: Your payment was not successful. Please try again.
am: ክፍያዎ አሊተሳካም! እባከዎ እንደገና ይሞክሩ!!

source: Dear <b>%(user_name)s</b>, your business is registered successfully. However, it is not active until you complete the payment process. Please select a subscription plan to activate your business.
am: ውድ <b>"%(user_name)s"</b>፡ ቢዝነሰዎ በተሳካ ተመዝግቧል። ነገር ግን እርስዎ ክፍያ ካልጨረሱ አይሰራም። እባኮት የቢዝነሰዎን ለማበረታታት ሳብስክሪብሽን ፕላን ይምረጡ።

source: Monthly
am: ወርህዊ

source: Six Months
am: የስድስት ወር

source: Yearly
am: አመታዊ

source: Proceed to Pay
am: ለመክፈል ይቀጥሉ

source: Payment Successful
am: ክፍያዎ ተሳክቷል

source: Your shop "%(shop_name)s" is now active until %(valid_to)s.
am: የእርስዎ ቢዝነስ "%(shop_name)s" እስከ %(valid_to)s ድረስ አክቲቭ ነው።

source: Pay for your order
am: ለትእዛዘዎ ይክፈሉ።

source: Order summary
am: የትእዛዝ ማጠቃለያ

source: %d Shop was successfully Refreshed and expired shop is Deactivated
am: %d ሱቅ በታሰካ ሁኔታ ረፍሪሽ ሁኗል፤ ጊዚ ያለፈበት እንዳይሰራ ሁኗል።

source: %d Product was successfully Disabled it Avaliablity
am: %d ምርት አለመኖሩ ታውቋል።

source: %d Product was successfully Enable its Avaliablity
am: %d ምርት መኖሩ ታውቋል።

source: Jemberu's shop
am: የጀምበሩ ሱቅ

source: Language
am: ቋንቋ

source: Home
am: ዋና ገዕ

source: register your Business
am: ቢዝነሰዎን ይመዝገቡ

source: admin page
am: አድሚን ገዕ

source: your shop
am: የርሰዎ ሱቅ

source: News
am: መረጃ

source: Login
am: ሎጊን

source: Sign Up
am: ሳይን አፕ

source: Update Profile
am: መገለጫዎን ይቀይሩ

source: Logout
am: መውጣት

source: search for products
am: ምርት ፈልግ

source: Sort by
am: ቅደም ተከተል

source: We recommended
am: የኛ ምርጫ

source: Newest arrivals
am: አድስ የገቡ

source: Price: Low to High
am: ዋጋ ከትንሽ ወደ ትልቅ

source: Price: High to Low
am: ዋጋ ከትልቅ ወደ ትንሽ

source: Name: A to Z
am: ስም A ወደ Z

source: Name: Z to A
am: ስም Z ወደ A

source: Your cart
am: የእርሰዎ ዘምቢል

source: %(items)s item, %(total)s Birr
am: %(items)s እቃ, %(total)s ብር

source: Your cart is empty.
am: የእርሰዎ ዘምቢል ባዶ ነዉ

source: Thank you for choice us, for more info contact us with
am: እኛን ስለመረጡን እናመሰኛለን። ለበለጠ መረጃ

source: Dear Customer, Welcome to <strong>%(shopname)s</strong>
am: ዉድ ደንበኛችን እንኳን ወደ <strong>%(shopname)s</strong> ደህና መጡ

source: Add to cart
am: ወደ ዘንቢል ጨምር

source: Poeple who bought this also bought
am: ይህን የገዙ ሰዎች ይህንም ይገዛሉ

source: Products
am: ምርት

source: Categories
am: ክፍል

source: Search Result
am: የፍለጋ ውጤት

source: </span id="one-shop-pro"> Products from %(shop_name)s</span>
am: የ %(shop_name)s ምርቶች

source: Products from All registered shops
am: የሁሉም ሱቆች ምርቶች

source: from
am: ከ

source: Dear Customer
am: ውድ ደንበንበኛችን

source: No products available
am: ምርት የለም

source: Registered Shops
am: የተመዘገቡ ሱቆች

source: Well Come Dear <strong>%(user_name)s </strong> Fill the Follwing info and procced to next step to activate your Business
am: %(user_name)s እንኳን ደህና መጡ፤ ቢዝነሰዎን አክትቭ ለማድረግ የሚከተለዉን መርጃ ይሙሉ።

source: How to Register Your Business
am: ቢዝነሰዎን ይመዝገቡ

source: Follow these steps to register your business successfully:
am: ቢዝነሰዎን በተሳካ ሁኔታ ለማስመዚገብ የሚከተለዉን ቅደም ተከተል ይከተሉ።

source: Enter the name of your business. give short and concise name
am: የቢዝነሰዎን ስም ያስገቡ፤ አጭር እና ገላጭ ስም ይስጡ።

source: Provide a address ,where your Businuss Found.
am: የቢዝነሰዎ የሚገኝበትን አድራሻ ያስገቡ።

source: Click on the Submit button to procced for registration.
am: ላክ የሚለዉን በመጫን ወደ ቀጣዩ ይሂዱ።

source: Benefits of Registering
am: የቢዝነሰዎ መመዝግብ የሚያገኙት ጥቅም፤

source: Reach more customers.
am: ውድ ደንበንበኛችን

source: Increase your sales.
am: ቢዝነሰዎን ይመዝገቡ

source: Gain access to special features.
am: ስፔሻል መግለጫወችን ያገኛሉ።

source: add your Business
am: ቢዝነሰዎን ይመዝገቡ

source: Business Name
am: የቢዝነሱ ስም

source: Address
am: አድራሻ

source: Phone Number
am: ስልክ ቁጥር

source: Submit
am: ላክ

source: Need Help?
am: እርዳታ ይፈልጋሉ?

source: If you have any questions, feel free to contact our support team at
am: ማንኛውም ጥያቄ ካለዎት ፡ በሚከተሉት አድራሻዎች ያናግሩን

source: FAQs
am: በብዛት የሚጠየቁ ጥያቄዎች

source: Q: What if I don’t have a business name yet?
am: የቢዝነስ ስም ባይኖረኝስ?

source: A: You can register as an individual seller and update your business name later.
am: ለጊዜው የፈልጉትን በማስገባት በፈለጉበት ሰአት የቢዝነሰዎን ስም መቀየር ይችላሉ።

source: Q: Can I change my business details later?
am: ቆይቸ የቢዝነሱን መግለጫ መቀየር እችላለሁ?

source: A: Yes, you can update your business details from your Adminstration page.
am: አዎ! የቢዝነሱን መግለጫ ከአድሚን ፒጅ መቀየር ይችላሉ።

source: Terms and Conditions
am: ደንብ እና ግዴታዎች

source: By registering, you agree to our
am: በመመዝገብ ፣

source: terms and conditions
am: ደንብ እና ግዴታዎች

source: Update your profile
am: መገለጫዎን ይቀይሩ

source: Email Address
am: ኢሜል አድራሻ

source: Profile Image
am: መገለጫ ፎቶ

source: Biography
am: ባይዎግራፊ

source: There is no %(product)s product in our shop
am: %(product)s እምባል ምርት የለም

source: one onwer should register for one shop
am: አንድ የሱቅ ባለቤት ለአንድ ሱቅ ብቻ ይመዘገባል።

source: please enter correct data
am: እባከዎ ትክክለኛ ዳታ ያስገቡ

source: Product deleted successfully
am: በተሳካ ሁኔታ ጠፊቷል

source: Welcome,
am: እንኳን ደህና መጡ

source: View site
am: ወደ ሁም ፔጅ

source: Documentation
am: ዶክመንቴሽን

source: Change password
am: ፓስዋርድ ቀይር

source: Log out
am: ይውጡ
